# ls = [{"tigger","lion"},{"rabbit","pig"}]

# print(f"i like animal like {ls[0]} or {ls[1]}")

# ls = [{"korea"]

# b = [0,1,2,3,4,5,6,7,8,9]

# print(b[2:8:2])

# print(b[::3])
#################################################################

# colors={"red", "green","blue"}

# e = set()

# fruits = set(colors)

# print(fruits)

# box1 = {"1","2","3"}
# box2={"2"}
# print(box1-box2)

# # 튜플에는 순서가 없다 ! 
###################################################################



# box1 = {"1","2","3"}

# print("1" in box1)

## 딕셔너리 ## 

# ages = { "suzuki ":30, "sksks": 20, "kkk":25}

# # print(ages["sksks"])
# # print(ages)

# print(list(ages.keys())) # 딕셔너리의 키의 값을 볼 수 있음. 

# print(ages.values())

#################################################################

# 여러 개의 값을 여러 개의 변수에 저장할 수 있다. 
# a,b,c = [20,30,40]

# # print(a,b,c)

# # z,x,c,v = [50,70,80,100]

# # print(z,x,c,v)

##################################################################

# a = "a와b는 : c이다."

# a = a.replace(":",",")

# print(a)

# a.split(":")

# print(a)

# 리플레이스로 문자열 안의 바꾸고 싶은 것을 바꿀 수 있다. 
##################################################################

# print("love" * 3)

# s = "this is a pen"

# # print(s.split())

# s = "2020/02/20"

# print(s.split("/",maxsplit=1))

# maxsplit = 1 하면, 1번만 분할함. !!! 

###################################################################

# a = ["aaa","bbb","ccc"]

# print("-".join(a)) # - 로, a 리스트의 원소들을 묶는 것. 

###################################################################

# s = "this is a pen"

# print(s.replace("pen","note"))


a = ["aaa"]

print("aaa".upper())

